app/controllers/clients_controller.rb

  def index
    @clients = Client.search(params)
---
SELECT "clients".* FROM "clients"

  def create
    @client = Client.new(client_params)

    result =
        if @client.save
---
INSERT INTO "clients" ("name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sentinel"], ["code", "0001-ABC"], ["created_at", "2015-08-18 15:23:38.428082"], ["updated_at", "2015-08-18 15:23:38.428082"]]

  def update
    result =
        if @client.update(client_params)
---
UPDATE "clients" SET "name" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name", "rrq"], ["updated_at", "2015-08-19 16:21:57.487287"], ["id", 3]]

  def destroy
    result =
        if @client.destroy
---
DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 3]]