app/controllers/communications_controller.rb

  def index
    @communications = Communication.all
---
SELECT "communications".* FROM "communications"

  def create
    respond_to do |format|
      if Communication.create(communication_params)
---
INSERT INTO "communications" ("org_code", "client_code", "primary_email", "secondary_email", "primary_phone", "secondary_phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    respond_with Communication.find(params[:id])
---
SELECT  "communications".* FROM "communications" WHERE "communications"."id" = ? LIMIT 1  [["id", 0]]