app/controllers/orgs_controller.rb

  def index
    @orgs = Org.search(params)
---
SELECT `orgs`.* FROM `orgs`

  def create
    @org = Org.new(org_params)

    result =
        if @org.save
---
INSERT INTO "orgs" ("name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sentinel"], ["code", "0001-ABC"], ["created_at", "2015-08-18 13:10:10.925018"], ["updated_at", "2015-08-18 13:10:10.925018"]]

  def set_org
    @org = Org.find(params[:id])
---
SELECT  "orgs".* FROM "orgs" WHERE "orgs"."id" = ? LIMIT 1  [["id", 1]]