app/controllers/prosesses_controller.rb

SELECT "prosesses".* FROM "prosesses"
---
  def index
    if(params[:sort])
      @prosesses = Prosess.order(params[:sort]).all

INSERT INTO "prosesses" ("name", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "aaa"], ["code", "aaa"], ["created_at", "2015-08-17 13:23:01.889700"], ["updated_at", "2015-08-17 13:23:01.889700"]]
---
  def create
    respond_to do |format|
      if Prosess.create(prosess_params)

SELECT  "prosesses".* FROM "prosesses" WHERE "prosesses"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    respond_with Prosess.find(params[:id])

SELECT  "prosesses".* FROM "prosesses" WHERE "prosesses"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "prosesses" SET "name" = ?, "updated_at" = ? WHERE "prosesses"."id" = ?  [["name", "aaaa"], ["updated_at", "2015-08-17 13:23:12.576001"], ["id", 1]]
---
  def update
    @prosess = Prosess.find(params[:id])
    respond_to do |format|
      if @prosess.update(prosess_params)

SELECT  "prosesses".* FROM "prosesses" WHERE "prosesses"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "prosesses" WHERE "prosesses"."id" = ?  [["id", 1]]
---
  def destroy
    @prosess = Prosess.find(params[:id])
    respond_to do |format|
      if @prosess.destroy